; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	infrared0 - mode
	spectrograph1 - mode
	Star2 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation4 - direction
	Star9 - direction
	GroundStation5 - direction
	Star10 - direction
	Star12 - direction
	GroundStation6 - direction
	GroundStation11 - direction
	GroundStation3 - direction
	Star8 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon15)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star10)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 Star8)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star10)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star10)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star12)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation11)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 Star12)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation6)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star8)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star16)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 GroundStation5)
	(pointing satellite2 GroundStation4)
	(pointing satellite4 Star9)
	(have_image Planet13 spectrograph1)
	(have_image Phenomenon14 infrared0)
	(have_image Phenomenon15 spectrograph1)
	(have_image Star16 spectrograph1)
	(have_image Planet17 infrared0)
))

)

; plan
1. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 0 of 9
2. (calibrate satellite3 instrument8 groundstation6)
   added: (calibrated instrument8)
   goals met: 0 of 9
3. (turn_to satellite3 phenomenon15 groundstation6)
   deleted: (pointing satellite3 groundstation6)
   added: (pointing satellite3 phenomenon15)
   goals met: 0 of 9
4. (take_image satellite3 phenomenon15 instrument8 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 1 of 9
5. (turn_to satellite3 phenomenon14 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 phenomenon14)
   goals met: 1 of 9
6. (turn_to satellite2 groundstation4 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 groundstation4)
   goals met: 2 of 9
7. (turn_to satellite1 groundstation5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation5)
   goals met: 3 of 9
8. (turn_to satellite0 star2 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star2)
   goals met: 4 of 9
9. (take_image satellite3 phenomenon14 instrument8 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 5 of 9
10. (turn_to satellite3 planet13 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet13)
   goals met: 5 of 9
11. (take_image satellite3 planet13 instrument8 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 6 of 9
12. (turn_to satellite3 planet17 planet13)
   deleted: (pointing satellite3 planet13)
   added: (pointing satellite3 planet17)
   goals met: 6 of 9
13. (take_image satellite3 planet17 instrument8 infrared0)
   added: (have_image planet17 infrared0)
   goals met: 7 of 9
14. (turn_to satellite3 star16 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 star16)
   goals met: 7 of 9
15. (take_image satellite3 star16 instrument8 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 8 of 9
16. (turn_to satellite4 star9 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 star9)
   goals met: 9 of 9
